; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op- blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks_words)
	(:domain blocks)
(:objects 

D R A W O E P C - block
)
(:init
(HANDEMPTY)
(CLEAR O)
(ONTABLE O)
(CLEAR R)
(ON R P)
(ONTABLE P)
(CLEAR E)
(ONTABLE E)
(CLEAR D)
(ON D A)
(ON A C)
(ONTABLE C)
(CLEAR W)
(ONTABLE W)
)
(:goal (and
(CLEAR R)
(ONTABLE E)
(ON R A)
(ON A P)
(ON P E)
))
)

; plan
1. (unstack r p)
   deleted: (clear r) (handempty) (on r p)
   added: (holding r) (clear p)
   goals met: 1 of 5
2. (stack r w)
   deleted: (holding r) (clear w)
   added: (clear r) (handempty) (on r w)
   goals met: 2 of 5
3. (unstack d a)
   deleted: (clear d) (handempty) (on d a)
   added: (holding d) (clear a)
   goals met: 2 of 5
4. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 2 of 5
5. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 2 of 5
6. (stack p e)
   deleted: (holding p) (clear e)
   added: (clear p) (handempty) (on p e)
   goals met: 3 of 5
7. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 3 of 5
8. (stack a p)
   deleted: (holding a) (clear p)
   added: (clear a) (handempty) (on a p)
   goals met: 4 of 5
9. (unstack r w)
   deleted: (clear r) (handempty) (on r w)
   added: (holding r) (clear w)
   goals met: 3 of 5
10. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 5 of 5
